MicrochipTech/dspic33a-high-speed-adc-example/adc_dma_40msps.c
    /* Persistent first: if printing itself traps, the next boot can still
     * be told what happened. */
    trap_seen++;
    trap_vec   = vec;
    trap_stage = boot_stage;

    /* Stop the measurement, so a 40 MSPS stream does not keep hammering
     * the bus while we print. */
    IEC2bits.DMA0IE = 0;
    DMA0CHbits.CHEN = 0;
    INTCON1bits.GIE = 0;

    /* LED on before the first character is attempted. Printing needs a
     * working UART and a sane clock; this needs neither, so a lit LED0
     * with nothing on the terminal is itself the message "trapped, and
     * the console did not survive it". */
    LED_TRIS = 0u;
    LED_ON();

    trap_report(vec);

    fail_code = 9u;
    const uint32_t ms100 = (CLK1CONbits.COSC == NOSC_PLL2_OUT)
                           ? 20000000ul : 800000ul;
    LED_TRIS = 0u;
    for (;;) {
        for (uint32_t i = 0; i < 9u; i++) {
            LED_ON();  __delay32(2u * ms100);
            LED_OFF(); __delay32(2u * ms100);
        }
        __delay32(10u * ms100);
    }
}

void fail(uint32_t code)
{
    fail_code = code;
    IEC2bits.DMA0IE = 0;
    DMA0CHbits.CHEN = 0;

    /* Say why, with everything a reader needs, before blinking forever.
     * The UART is up from the first line of main() on, so this works for
     * the clock steps too. */
    console_sync_baud();
    console_puts("\r\n");
    console_kv("[FAIL] code", code);
    console_puts("[FAIL] ");
    console_puts((code < FAIL_TEXT_N) ? fail_text[code] : "unknown code");
    console_puts("\r\n");
    regs_dump();
    console_puts("[FAIL] LED0 blinks the code from now on\r\n");

    /* 100 ms in CPU cycles: 200 MHz once PLL2 drives CLKGEN1, else the
     * 8 MHz FRC we started on. */
    const uint32_t ms100 = (CLK1CONbits.COSC == NOSC_PLL2_OUT)
                           ? 20000000ul : 800000ul;
    LED_TRIS = 0u;
    for (;;) {
        for (uint32_t i = 0; i < code; i++) {
            LED_ON();  __delay32(2u * ms100);
            LED_OFF(); __delay32(2u * ms100);
        }
        __delay32(10u * ms100);
    }
}

/* Wait until a condition becomes false, or give up with a code.
 *
 * Simulator build: no waiting at all. The MPLAB X simulator has no PLL,
 * no ADC conversion and no DMA transfer, so every one of these conditions
 * would time out and end the run in fail(1) before anything of interest
 * had executed. The register writes stay exactly as on hardware; only the
 * waits go - the same pattern MCC's clock.c uses. */
#ifdef __MPLAB_DEBUGGER_SIMULATOR
#define WAIT_WHILE(cond, code)  do { (void)(cond); } while (0)
#else
#define WAIT_WHILE(cond, code)                              \
    do {                                                    \
        uint32_t n_ = WAIT_LIMIT;                           \
        while (cond) {                                      \
            if (--n_ == 0u) { fail(code); }                 \
        }                                                   \
    } while (0)
#endif

/* ------------------------------------------------------------------ *
 * Clock setup
 *
 * Two PLLs, because the two rates this example needs are both exact
 * multiples of the 8 MHz FRC and neither needs a fractional divider:
 *
 *   PLL1 -> 320 MHz -> CLKGEN6 -> ADC   (TAD = 4/320 MHz = 12.5 ns)
 *   PLL2 -> 200 MHz -> CLKGEN1 -> CPU, DMA and the standard peripherals
 *
 * THE SWITCHING ORDER IS NOT OPTIONAL. DS70005591D page 778 spells it
 * out, and skipping a step does not fail loudly - it leaves the old
 * divider values in place and the part runs at the wrong speed:
 *
 *   a) set PLLSWEN  -> allows the input and feedback dividers to update
 *   c) set FOUTSWEN -> allows the output dividers to update
 *   d) select the source in NOSC
 *   e) set OSWEN    -> perform the switch
 *
 * Each of those bits clears itself when its step has completed, so each
 * one is followed by a (bounded) wait.
 *
 * Also from page 778: "The output dividers POSTDIV1 and POSTDIV2 should
 * not be changed while the PLL is operating", and POSTDIV1 must be >=
 * POSTDIV2.
 *
 * The divider values below are the ones Microchip's own MCC-generated
 * example uses for this part on this board, which is the reason to prefer
 * them over an equally valid arithmetic alternative - they have run on
 * hardware:
 *   https://github.com/microchip-pic-avr-examples/dspic33ak-curiosity-adc-40msps
 *
 *   PLL1DIV = 0x0100C829 : N1=1, M=200, POSTDIV1=5, POSTDIV2=1
 *                          8 MHz -> FVCO 1600 MHz -> 320 MHz
 *   PLL2DIV = 0x01007D29 : N1=1, M=125, POSTDIV1=5, POSTDIV2=1
 *                          8 MHz -> FVCO 1000 MHz -> 200 MHz
 *
 * Bit layout of PLLxDIV (ATDF): POSTDIV2[2:0], POSTDIV1[5:3],
 * PLLFBDIV[16:8], PLLPRE[27:24].
 *
 * Constraints checked against Table 40-23 and page 777: F_PFD >= 5 MHz,
 * F_VCO 500...1600 MHz, M in 16...320, POSTDIV1 >= POSTDIV2.
 *
 * OSCCTRL.PLLxEN is deliberately NOT written here. It looks like it should
 * be - 12.4.6 (p776) says "the PLLs can be enabled by PLLxEN bits" - but
 * neither the normative procedure (12.4.6.3, Example 12-4, p781) nor the
 * MCC example ever sets it; both rely on PLLxCON.ON, whose clock-request
 * path enables the PLL. A first attempt on hardware additionally set
 * PLLxEN and waited for PLLxRDY *before* the first divider write, on the
 * strength of Example 16-3 (p1328) - but that snippet sits in the ADC
 * chapter's gain-calibration example, is duplicated verbatim in Example
 * 17-4 (p1392) with a contradictory comment, and its own arithmetic does
 * not add up (FBDIV=80, POSTDIV1=4 is 160 MHz, not the 320 MHz claimed).
 * Waiting for PLLxRDY before the dividers means waiting for a lock on the
 * POR configuration (M=200, POSTDIV1=2, POSTDIV2=2 -> 400 MHz), which is
 * exactly the kind of intermediate state 12.4.6.1 note 2 (p779) warns
 * about. Do not reintroduce it; follow the MCC order, which has run on
 * silicon.
 * ------------------------------------------------------------------ */
void clock_init(void)
{
    /* If the system clock is currently running off a PLL, park it on the
     * FRC first. Changing PLL settings underneath a running CPU clock can
     * overclock the core - this matters on a debugger restart, where the
     * part is not freshly reset. (The MCC example does the same.) */
    console_kv_hex("[clk] CLK1CON at entry", CLK1CON);
    if ((CLK1CONbits.COSC >= NOSC_PLL1_OUT) && (CLK1CONbits.COSC <= 0x8u)) {
        console_puts("[clk] system clock on a PLL, parking on FRC\r\n");
        CLK1CONbits.NOSC  = NOSC_FRC;
        CLK1CONbits.OSWEN = 1u;
        WAIT_WHILE(CLK1CONbits.OSWEN, 3u);
    }

    /* ---- PLL1: 320 MHz for the ADC ---- */
    PLL1CON = 0x8100u;          /* ON = 1, NOSC = FRC                   */
    PLL1DIV = 0x0100C829u;      /* N1=1, M=200, POSTDIV1=5, POSTDIV2=1  */

