MicrochipTech/dspic33a-high-speed-adc-example/adc_dma_40msps.c
    DMA0SEL = DMA_TRIG_ADC_CH0;             /* ADCn Done CH0            */
    DMA0SRC = (uint32_t)&ADCREG(CH0RES);    /* per-conversion result    */
    DMA0DST = (uint32_t)buf;                /* RAM destination          */
    DMA0CNT = SAMPLES_PER_BUF;              /* transactions per block   */
    DMA0STAT = 0u;                          /* clear any stale flags    */

    DMA0CH = 0u;
    DMA0CHbits.SIZE    = 1u;          /* 16-bit transfers               */
    DMA0CHbits.SAMODE  = 0u;          /* source address unchanged       */
    DMA0CHbits.DAMODE  = 1u;          /* destination incremented        */
    DMA0CHbits.TRMODE  = 3u;          /* repeated continuous            */
    DMA0CHbits.RELOADD = 1u;          /* reload destination each block  */
    DMA0CHbits.RELOADC = 1u;          /* reload count each block        */
    DMA0CHbits.HALFEN  = 1u;          /* interrupt at half              */
    DMA0CHbits.DONEEN  = 1u;          /* interrupt on block complete    */
    DMA0CHbits.RETEN   = 0u;          /* see note 1 at the counters     */

    /* Round robin arbitration. With one channel it makes no difference,
     * but it is the setting that matters once several ADC streams share
     * the single DMA data bus (DS70005591D 13.4.4, p825). */
    DMACONbits.PRIORITY = 1u;

    DMACONbits.ON   = 1;
    DMA0CHbits.CHEN = 1;

    /* Block-complete interrupt: IRQ 77, IEC2/IFS2 bit 13, IPC9 default
     * priority 4. Nothing fires until the first burst is started. */
    IFS2bits.DMA0IF = 0;
    IEC2bits.DMA0IE = 1;
    console_puts("[dma] channel 0 armed, window 0x4000..0x13FFF, IRQ on\r\n");
}

bool dma0_enabled(void)
{
    return DMA0CHbits.CHEN != 0u;
}

/* ------------------------------------------------------------------ *
 * DMA interrupt - one per buffer half
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Priority 4 (IPC9 default). The console's UART receive interrupt runs
 * at priority 1, so this ISR preempts a running command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long ISR would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
static void dma0_on_event(uint32_t st)
{
    if (st & _DMA0STAT_OVERRUN_MASK) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        DMA0STATbits.OVERRUN = 0;
    }
    if (st & _DMA0STAT_ADRERR_MASK) {
        dma_addr_err++;
        DMA0STATbits.ADRERR = 0;
    }
    if (st & (_DMA0STAT_BRERR_MASK | _DMA0STAT_BWERR_MASK)) {
        dma_bus_err++;
        DMA0STATbits.BRERR = 0;
        DMA0STATbits.BWERR = 0;
    }

    /* Both halves pending at once means this ISR arrived more than one
     * half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & _DMA0STAT_HALF_MASK) && (st & _DMA0STAT_DONE_MASK)) {
        late_service++;
    }

    if (st & _DMA0STAT_HALF_MASK) {
        DMA0STATbits.HALF = 0;
        ready_half  = 0u;
        last_sample = buf[SAMPLES_PER_HALF - 1u];
        blocks_done++;
    }
    if (st & _DMA0STAT_DONE_MASK) {
        DMA0STATbits.DONE = 0;
        ready_half  = 1u;
        last_sample = buf[SAMPLES_PER_BUF - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            ADCREG(CH0CON1bits).PINSEL = pinsel_next;
            ADCREG(CH0CON1bits).SAMC   = samc_next;
            pinsel_cur = pinsel_next;
            samc_cur   = samc_next;
            switch_pending = false;
        }
        if (run_enabled) {
            adc_start_burst();        /* next SAMPLES_PER_BUF samples   */
        } else {
            burst_active = false;
        }
    }
}

void __attribute__((interrupt, no_auto_psv)) _DMA0Interrupt(void)
{
    dma0_on_event(DMA0STAT);          /* one snapshot, then act on it   */
    IFS2bits.DMA0IF = 0;
}

#ifdef __MPLAB_DEBUGGER_SIMULATOR
/* ------------------------------------------------------------------ *
 * Simulator stand-in for the ADC and the DMA
 *
 * The MPLAB X simulator has neither peripheral, and it does not
 * dispatch interrupts in this project either (see tools/sim_trap.py).
 * So the only producer of measurement data, the DMA ISR above, never
 * runs there. This stand-in plays its part: each call fills the next
 * buffer half the way the DMA would and then hands the same status
 * word to dma0_on_event() that the ISR would have taken from DMA0STAT.
 * Everything downstream - blocks_done, ready_half, last_sample, the
 * input switch at DONE, burst restart, capture_service(), the self-test,
 * the status lines - runs unchanged.
 *
 * Signal: on SELFTEST_PINSEL a flat 3840 (15/16 VDD, what the self-test
 * expects); on any other input a 1 MHz sine, 2048 +/- 1600 counts.
 * 1 MHz at 40 MSPS is 40 samples per period, which is what this ADC
 * is for: an 8 MSPS converter would see the same tone with 8 points.
 * A half of 1024 samples holds 25.6 periods, so the phase runs on
 * across the half boundary like a real signal would, and the per-half
 * sum (proc_result) alternates between two values - a cheap check that
 * the halves are really being served in order.
 *
 * Timing is not modelled: a half arrives per call, whenever the loop
 * calls. It is called from wait_for_blocks() and from main()'s loop
 * (SIM_DMA_TICK), so exactly one half is produced per service and
 * proc_missed stays 0. Errors can be injected from MDB while running:
 *   write <addr of sim_fault_once> <mask>
 * ORs the mask (e.g. _DMA0STAT_OVERRUN_MASK) into the next status word.
 * ------------------------------------------------------------------ */
#define SIM_SINE_PERIOD   40u             /* samples: 40 MSPS / 40 = 1 MHz */

static const uint16_t sim_sine[SIM_SINE_PERIOD] = {   /* 2048 + 1600 sin */
    2048, 2298, 2542, 2774, 2988, 3179, 3342, 3474, 3570, 3628,
    3648, 3628, 3570, 3474, 3342, 3179, 2988, 2774, 2542, 2298,
    2048, 1798, 1554, 1322, 1108,  917,  754,  622,  526,  468,
     448,  468,  526,  622,  754,  917, 1108, 1322, 1554, 1798
};

volatile uint32_t sim_fault_once = 0;     /* MDB: OR into the next status */

void sim_dma_tick(void)
{
    static uint32_t half  = 0u;
    static uint32_t phase = 0u;

    if (!burst_active) {                  /* stopped: no DMA events either */
        return;
    }

